Revit 2024 API
FittingAngleUsage Enumeration
 An enumerated type representing the options for how to limit the angle values applicable to fitting content.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public enum FittingAngleUsage
Visual Basic
Public Enumeration FittingAngleUsage
Visual C++
public enum class FittingAngleUsage
Members
Member name | Description
UseAnyAngle |  Uses any angle supported by fitting content.
UseAnAngleIncrement |  Uses the increment to determine the angle value.
UseSpecificAngles |  Uses only the angles specified.
See Also
Autodesk.Revit.DB Namespace